Terraform plan for user group permissions in new global module (since these only need applied once and not per env):
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_group_policy_attachment.app_eng_parameter_store will be created
  + resource "aws_iam_group_policy_attachment" "app_eng_parameter_store" {
      + group      = "AGPAYM3RJQIPSTZCQ5WZG"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_group_policy_attachment.devops_eng_parameter_store will be created
  + resource "aws_iam_group_policy_attachment" "devops_eng_parameter_store" {
      + group      = "AGPAYM3RJQIPREIKQHL3Z"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.app_eng_parameter_store will be created
  + resource "aws_iam_policy" "app_eng_parameter_store" {
      + arn         = (known after apply)
      + description = "IAM policy for application engineer access to parameter store"
      + id          = (known after apply)
      + name        = "bfd-app-eng-parameter-store"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:DescribeParameters",
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:xxx:parameter/bfd/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:DeleteParameter",
                          + "ssm:DeleteParameters",
                          + "ssm:LabelParameterVersion",
                          + "ssm:PutParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:xxx:parameter/bfd/local/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.devops_eng_parameter_store will be created
  + resource "aws_iam_policy" "devops_eng_parameter_store" {
      + arn         = (known after apply)
      + description = "IAM policy for devops engineer access to parameter store"
      + id          = (known after apply)
      + name        = "bfd-admins-parameter-store"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:DeleteParameter",
                          + "ssm:DeleteParameters",
                          + "ssm:DescribeParameters",
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:LabelParameterVersion",
                          + "ssm:PutParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:xxx:parameter/bfd/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```